tutorials/packingCell/constant/effectiveTransportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      effectiveTransportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Deff            Deff [ 0 2 -1 0 0 0 0 ] ( 2.0885666 -2.1706983e-08 9.0820685e-25 -3.9838879e-08 2.0926918 -9.9271826e-26 2.2990231e-24 -1.7785148e-24 3.62783 );

DeffSymm        DeffII [ 0 2 -1 0 0 0 0 ] ( 2.089047 -2.0078738e-08 2.7147667e-25 -2.0078738e-08 2.0906438 -5.3818085e-25 2.7147667e-25 -5.3818085e-25 3.62783 );

lambda          123.70366;

CI              CI [ 0 1 0 0 0 0 0 ] ( 0.0010550542 4.7617139e-10 0 );

Ueff            Ueff [ 0 1 -1 0 0 0 0 ] ( 0.89618937 3.878953e-09 3.9428269e-25 );


// ************************************************************************* //
