tutorials/packingCell/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "3109";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
31744
(
(1.4917662 0.00025297232 1.3158635e-24)
(1.4907525 0.00075943095 1.2411997e-27)
(1.4887287 0.0012656642 -1.3186687e-24)
(1.4856926 0.0017715203 2.8392538e-27)
(1.4816453 0.002276845 1.3353514e-24)
(1.4765883 0.0027814814 4.5711339e-27)
(1.4705231 0.0032852684 -1.3551072e-24)
(1.4634515 0.0037880403 6.1390654e-27)
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    solid_sphere4_4
    {
        type            noSlip;
    }
    solid_sphere5_5
    {
        type            noSlip;
    }
    solid_sphere6_6
    {
        type            noSlip;
    }
    solid_sphere13_13
    {
        type            noSlip;
    }
    top_cyc
    {
        type            cyclic;
    }
    bottom_cyc
    {
        type            cyclic;
    }
    left_cyc
    {
        type            cyclic;
    }
    right_cyc
    {
        type            cyclic;
    }
}


// ************************************************************************* //
